CREATE TABLE item (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT,
  category_id INTEGER,
  FOREIGN KEY(category_id) REFERENCES category(id)
);

CREATE TABLE category (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT,
  parent_category_id INTEGER,
  FOREIGN KEY(parent_category_id) REFERENCES category(id)
);

INSERT INTO category(id, name, parent_category_id) VALUES
-- Обязательные поля
(1, "Расходы", -1),
(0, "Доходы", -1),

-- Папки

-- Доходы

-- Личное
(2, "Личные доходы", 0),
-- Бизнес
(3, "Бизнес доходы", 0),

-- Расходы

-- Личное
(4, "Личные расходы", 1),
-- Бизнес
(5, "Бизнес расходы", 1),
(6, "Сотрудники", 5),
(7, "Содержание салона", 5),
(8, "Доставка", 5);

INSERT INTO item(id, name, category_id) VALUES
-- Личные расходы
(0, "Авто", 4),
(1, "Еда", 4),
(2, "Семья", 4),
(3, "Мото", 4),
(4, "Развлечения", 4),
(5, "Учеба", 4),
-- Личные доходы
(6, "Сдача квартиры", 2),
(7, "Работа", 2),
(8, "Перекупство", 2),

-- Бизнес расходы
-- Сотрудники
(9, "Бухгалтер", 6),
(10, "Контент менеджер", 6),
(11, "МОП", 6),
(12, "РОП", 6),
-- Содержание салона
(13, "Уборка", 7),
(14, "Вода", 7),
(15, "Еда", 7),
(16, "Посуда", 7),
-- Доставка
(17, "Яндекс", 8),
(18, "Поставщики", 8),

-- Бизнес доходы
(19, "Бонусы от поставщиков", 3),
(20, "Наличка", 3),
(21, "Партнеры", 3);
